picocomputer/rp6502/src/tinyusb_rp6502/hcd_rp2040 copy.c
/*
 * The MIT License (MIT)
 *
 * Copyright (c) 2020 Raspberry Pi (Trading) Ltd.
 * Copyright (c) 2021 Ha Thach (tinyusb.org) for Double Buffered
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 *
 * This file is part of the TinyUSB stack.
 */

#include "tusb_option.h"

#if CFG_TUH_ENABLED && (CFG_TUSB_MCU == OPT_MCU_RP2040) && !CFG_TUH_RPI_PIO_USB && !CFG_TUH_MAX3421

#include "pico.h"
#include "portable/raspberrypi/rp2040/rp2040_usb.h"
#include "osal/osal.h"
#include "host/hcd.h"
#include "host/usbh.h"

// These two SIE_STATUS bits are absent from the RP2040 SDK
// headers but are present in the RP2350 SDK headers.
#ifndef USB_SIE_STATUS_RX_SHORT_PACKET_BITS
#define USB_SIE_STATUS_RX_SHORT_PACKET_BITS 0x00001000u
#endif
#ifndef USB_SIE_STATUS_ENDPOINT_ERROR_BITS
#define USB_SIE_STATUS_ENDPOINT_ERROR_BITS 0x00800000u
#endif

// port 0 is native USB port, other is counted as software PIO
#define RHPORT_NATIVE 0

// First EP0 is shared EPX
#ifndef PICO_USB_HOST_INTERRUPT_ENDPOINTS
#define PICO_USB_HOST_INTERRUPT_ENDPOINTS (USB_MAX_ENDPOINTS - 1)
#endif
static_assert(PICO_USB_HOST_INTERRUPT_ENDPOINTS <= USB_MAX_ENDPOINTS, "");

// Host mode uses one shared endpoint register for non-interrupt endpoints
static struct hw_endpoint ep_pool[1 + PICO_USB_HOST_INTERRUPT_ENDPOINTS];
#define epx (ep_pool[0])

static inline bool need_pre(uint8_t dev_addr);

// EP0 max packet size per device address. The RP2040 shares a single EPX for
// all control transfers, so its wMaxPacketSize can become stale when switching
// between devices with different EP0 sizes (e.g. low-speed MPS=8 vs full-speed
// MPS=64). We track the correct value here and apply it in hcd_setup_send().
static uint8_t _ep0_mps[CFG_TUH_DEVICE_MAX + CFG_TUH_HUB + 1]; // +1 for addr0

// The RP2040 SIE shares a single set of handshake latches (ACK_REC, NAK_REC,
// etc.) across EPX and interrupt endpoint transactions.  When the SIE finishes
// an EPX transaction and immediately starts an interrupt endpoint poll, the
// poll's handshake response overwrites the EPX latches before the IRQ handler
// can read them.  Without suppression, a valid ACK'd EPX completion appears
// as RX_TIMEOUT or DATA_SEQ_ERROR, breaking control transfer enumeration.
// To prevent this, we disable interrupt endpoint polling (int_ep_ctrl = 0)
// before every EPX START_TRANS and restore it after the IRQ handler has
// finished processing the EPX completion.
static bool _int_ep_suppressed;

// Flags we set by default in sie_ctrl (we add other bits on top)
enum {
  SIE_CTRL_BASE = USB_SIE_CTRL_SOF_EN_BITS      | USB_SIE_CTRL_KEEP_ALIVE_EN_BITS |
                  USB_SIE_CTRL_PULLDOWN_EN_BITS | USB_SIE_CTRL_EP0_INT_1BUF_BITS
};

// Compute the int_ep_addr_ctrl register value for an async endpoint.
// This encodes the device address, endpoint number, direction, and preamble
// into the format the SIE expects for polling.
TU_ATTR_ALWAYS_INLINE static inline uint32_t compute_int_ep_addr(struct hw_endpoint const *ep) {
  uint8_t const num = tu_edpt_number(ep->ep_addr);
  tusb_dir_t const dir = tu_edpt_dir(ep->ep_addr);
  uint32_t reg = (uint32_t)(ep->dev_addr | (num << USB_ADDR_ENDP1_ENDPOINT_LSB));
  if (dir == TUSB_DIR_OUT) {
    reg |= USB_ADDR_ENDP1_INTEP_DIR_BITS;
  }
  if (need_pre(ep->dev_addr)) {
    reg |= USB_ADDR_ENDP1_INTEP_PREAMBLE_BITS;
  }
  return reg;
}

// Compute the int_ep_ctrl value from the current set of configured endpoints.
TU_ATTR_ALWAYS_INLINE static inline uint32_t compute_int_ep_ctrl(void) {
  uint32_t val = 0;
  for (uint i = 1; i < TU_ARRAY_SIZE(ep_pool); i++) {
    if (ep_pool[i].configured) {
      val |= 1u << (ep_pool[i].interrupt_num + 1);
    }
  }
  return val;
}

static void suppress_int_polling(void) {
  // Zero int_ep_ctrl to disable all async endpoint polling slots while
  // EPX owns the handshake latches.
  usb_hw->int_ep_ctrl = 0;
  _int_ep_suppressed = true;
}

static void unsuppress_int_polling(void) {
  if (!_int_ep_suppressed) {
    return;
  }
  usb_hw->int_ep_ctrl = compute_int_ep_ctrl();
  _int_ep_suppressed = false;
}

static struct hw_endpoint *get_dev_ep(uint8_t dev_addr, uint8_t ep_addr) {
  uint8_t num = tu_edpt_number(ep_addr);
  if (num == 0) {
    return &epx;
  }

  for (uint32_t i = 1; i < TU_ARRAY_SIZE(ep_pool); i++) {
    struct hw_endpoint *ep = &ep_pool[i];
    if (ep->configured && (ep->dev_addr == dev_addr) && (ep->ep_addr == ep_addr)) {
      return ep;
    }
  }

  return NULL;
}

TU_ATTR_ALWAYS_INLINE static inline uint8_t dev_speed(void) {
  return (usb_hw->sie_status & USB_SIE_STATUS_SPEED_BITS) >> USB_SIE_STATUS_SPEED_LSB;
}

TU_ATTR_ALWAYS_INLINE static inline bool need_pre(uint8_t dev_addr) {
  // If this device is different from the speed of the root device
  // (i.e. is a low speed device on a full speed hub) then need pre
  return hcd_port_speed_get(0) != tuh_speed_get(dev_addr);
}

// RP2040 §4.1.2.5.1: APB writes to USB SIE registers (sie_ctrl, sie_status,
// buf_status, buffer_control AVAIL) need ~12 SIE clock cycles to propagate.
TU_ATTR_ALWAYS_INLINE static inline void hw_sie_settle(void) {
  busy_wait_us(1);
}

TU_ATTR_ALWAYS_INLINE static inline void epx_hard_reset(void) {
  usb_hw->sie_ctrl = SIE_CTRL_BASE;
  hw_sie_settle();
  usb_hw_clear->buf_status = 0x3u;
  *hwbuf_ctrl_reg_host(&epx) = 0;
}

