picocomputer/rp6502/src/tinyusb_rp6502/hcd_rp2040 copy.c
TU_ATTR_ALWAYS_INLINE static inline void epx_prepare_for_start(void) {
  // Zero EPX buf_status and buffer_control so stale FULL/AVAIL bits from the
  // previous phase cannot be misread as a new completion.  Both call sites
  // (hcd_edpt_xfer and hcd_setup_send) assert !epx.active before reaching
  // here, so this block always executes.
  if (!epx.active) {
    usb_hw_clear->buf_status = 0x3u;
    *hwbuf_ctrl_reg_host(&epx) = 0;
  }

  // Clear transient handshake/status latches before each EP0 phase start.
  usb_hw_clear->sie_status = USB_SIE_STATUS_ACK_REC_BITS |
                             USB_SIE_STATUS_NAK_REC_BITS |
                             USB_SIE_STATUS_STALL_REC_BITS |
                             USB_SIE_STATUS_DATA_SEQ_ERROR_BITS |
                             USB_SIE_STATUS_RX_TIMEOUT_BITS |
                             USB_SIE_STATUS_RX_SHORT_PACKET_BITS |
                             USB_SIE_STATUS_TRANS_COMPLETE_BITS |
                             USB_SIE_STATUS_ENDPOINT_ERROR_BITS;
  // Ensure status-latch clear is visible before we arm START_TRANS.
  hw_sie_settle();
}

static void __tusb_irq_path_func(hw_xfer_complete)(struct hw_endpoint *ep, xfer_result_t xfer_result) {
  // Reset endpoint state before notifying the stack so a re-arm inside the callback
  // sees ep->active == false and a clean xferred_len.
  uint8_t dev_addr = ep->dev_addr;
  uint8_t ep_addr = ep->ep_addr;
  uint xferred_len = ep->xferred_len;
  hw_endpoint_reset_transfer(ep);
  hcd_event_xfer_complete(dev_addr, ep_addr, xferred_len, xfer_result, true);
}

static void __tusb_irq_path_func(handle_hwbuf_status_bit)(uint bit, struct hw_endpoint *ep) {
  usb_hw_clear->buf_status = bit;

  if (!ep->active) {
    return;
  }

  const bool done = hw_endpoint_xfer_continue(ep);
  if (done) {
    hw_xfer_complete(ep, XFER_RESULT_SUCCESS);
  }
}

static void __tusb_irq_path_func(handle_hwbuf_status)(void) {
  uint32_t buf_status = usb_hw->buf_status;

  // Check EPX first.
  // In host mode, EPX uses a single buffer-control register (usbh_dpram->epx_buf_ctrl),
  // so only bit 0 of buf_status fires.  Bit 1 is the EP0_OUT slot in device mode but is
  // unused in host mode; the defensive 0x3u clears elsewhere handle it.
  uint32_t bit = 1u;
  if (buf_status & bit) {
    buf_status &= ~bit;
    struct hw_endpoint * ep = &epx;
    handle_hwbuf_status_bit(bit, ep);
  }

  // Check interrupt (async) endpoints.  Each IEP occupies two consecutive bits:
  // the lower bit is the IN direction and the upper bit is OUT.
  //   IEP1 IN  = bit 2,  IEP1 OUT = bit 3
  //   IEP2 IN  = bit 4,  IEP2 OUT = bit 5
  //   IEP3 IN  = bit 6,  IEP3 OUT = bit 7  ...etc.
  for (uint i = 1; i <= PICO_USB_HOST_INTERRUPT_ENDPOINTS && buf_status; i++) {
    for (uint j = 0; j < 2; j++) {
      bit = 1 << (i * 2 + j);
      if (buf_status & bit) {
        buf_status &= ~bit;
        handle_hwbuf_status_bit(bit, &ep_pool[i]);
      }
    }
  }

  if (buf_status) {
    panic("Unhandled buffer %u\n", (uint) buf_status);
  }
}

static void __tusb_irq_path_func(hw_trans_complete)(uint32_t buf_status_snapshot)
{
  if (usb_hw->sie_ctrl & USB_SIE_CTRL_SEND_SETUP_BITS)
  {
    pico_trace("Sent setup packet\n");
    struct hw_endpoint *ep = &epx;
    if (!ep->active) return;
    // A SETUP token is always exactly 8 bytes (USB 2.0 §9.3).
    ep->xferred_len = 8;
    hw_xfer_complete(ep, XFER_RESULT_SUCCESS);
  }
  else
  {
    // For non-setup EPX phases, completion is normally reported via BUFF_STATUS.
    // However, a STATUS-phase ZLP (LEN=0) generates TRANS_COMPLETE without
    // BUFF_STATUS: the SIE raises TRANS_COMPLETE when START_TRANS completes,
    // but BUFF_STATUS only fires on actual DPRAM buffer movement (zero bytes =
    // no movement). If EPX is still active here, complete it to avoid leaving
    // control transfers stuck.
    if (epx.active && ((buf_status_snapshot & 0x3u) == 0)) {
      hw_xfer_complete(&epx, XFER_RESULT_SUCCESS);
      return;
    }

    // Otherwise completion is handled by BUFF_STATUS processing.
    return;
  }
}

static void __tusb_irq_path_func(hcd_rp2040_irq)(void)
{
  uint32_t status = usb_hw->ints;
  uint32_t const buf_status_snapshot = usb_hw->buf_status;
  uint32_t handled = 0;

  if ( status & USB_INTS_HOST_CONN_DIS_BITS )
  {
    handled |= USB_INTS_HOST_CONN_DIS_BITS;
    // Clear the speed-change latch first so subsequent reads of sie_status
    // reflect the new (post-event) state.  The busy_wait gives the APB write
    // time to propagate before we read the bits back via dev_speed(); without
    // it the read can return 0 on a fast connect path (Heisenbug: the delay
    // introduced by UART logging masked this window).
    usb_hw_clear->sie_status = USB_SIE_STATUS_SPEED_BITS;
    hw_sie_settle();

    if ( dev_speed() )
    {
      hcd_event_device_attach(RHPORT_NATIVE, true);
    }
    else
    {
      // Device disconnected.  The SIE can have BUFF_STATUS and/or
      // TRANS_COMPLETE set simultaneously in this same status snapshot
      // (a transfer completed as the cable was pulled).  We must silence
      // the hardware and reset all endpoint software state NOW — before
      // the subsequent if-blocks run — so they find nothing to process.
      // If we let handle_hwbuf_status() or hw_trans_complete() run after
      // this, they deliver hcd_event_xfer_complete for a device the stack
      // is about to tear down, corrupting enumeration state.

      // Stop the SIE immediately (no new transactions).
      usb_hw->sie_ctrl = SIE_CTRL_BASE;
      hw_sie_settle();

      // Disable all EP1-15 interrupt endpoint polling.
      usb_hw->int_ep_ctrl = 0;
      _int_ep_suppressed = false;

      // Clear every pending buf_status bit so handle_hwbuf_status() is a
      // guaranteed no-op if BUFF_STATUS was also set in this snapshot.
      usb_hw_clear->buf_status = 0xffffffffu;
      *hwbuf_ctrl_reg_host(&epx) = 0;

      // Reset software endpoint state without delivering any completions.
      // hcd_device_close() (called by the stack from task context in
      // response to the remove event below) does the full teardown.
      if (epx.active) hw_endpoint_reset_transfer(&epx);
      for (uint i = 1; i < TU_ARRAY_SIZE(ep_pool); i++) {
        if (ep_pool[i].active) hw_endpoint_reset_transfer(&ep_pool[i]);
      }

      hcd_event_device_remove(RHPORT_NATIVE, true);
    }
  }

  if ( status & USB_INTS_HOST_RESUME_BITS )
  {
    // Remote wakeup: the device drove resume signalling on the bus.
    // Acknowledge the hardware latch.  Full suspend/resume state-machine
    // handling (hcd_event_device_resume) is not implemented; the RP6502 host
    // does not suspend devices, so this path is not expected in normal use.
    handled |= USB_INTS_HOST_RESUME_BITS;
    usb_hw_clear->sie_status = USB_SIE_STATUS_RESUME_BITS;
  }

  if ( status & USB_INTS_STALL_BITS )
  {
    // We have rx'd a stall from the device.
    // NOTE THIS SHOULD HAVE PRIORITY OVER BUFF_STATUS AND TRANS_COMPLETE
    // as the stall is an alternative response to one of those events.
    pico_trace("Stall REC\n");
    handled |= USB_INTS_STALL_BITS;
    usb_hw_clear->sie_status = USB_SIE_STATUS_STALL_REC_BITS;
    if (epx.active)
      hw_xfer_complete(&epx, XFER_RESULT_STALLED);
    epx_hard_reset();
  }

  if ( status & USB_INTS_ERROR_DATA_SEQ_BITS )
  {
    // NOTE THIS MUST HAVE PRIORITY OVER BUFF_STATUS AND TRANS_COMPLETE.
    // DATA_SEQ fires together with BUFF_STATUS in the same snapshot. If
    // BUFF_STATUS runs first, handle_hwbuf_status() sees the FULL bit and
    // accepts the wrong-PID data as SUCCESS, clearing ep->active — this
    // handler then becomes a no-op and the corrupted data is delivered.
    // By handling DATA_SEQ first and draining EPX buf_status before
    // BUFF_STATUS runs, we prevent that silent data poisoning.
    //
    // USB_INTS_ERROR_DATA_SEQ_BITS is wired to SIE_STATUS which only tracks
    // EPx — this interrupt never fires for EP1-15.
    handled |= USB_INTS_ERROR_DATA_SEQ_BITS;
    // DATA_SEQ is an error alternative to normal completion; suppress
    // BUFF_STATUS/TRANS_COMPLETE so the transfer is never reported SUCCESS.
    handled |= status & (USB_INTS_BUFF_STATUS_BITS | USB_INTS_TRANS_COMPLETE_BITS);
    usb_hw_clear->sie_status = USB_SIE_STATUS_DATA_SEQ_ERROR_BITS |
                   USB_SIE_STATUS_RX_SHORT_PACKET_BITS |
                   USB_SIE_STATUS_RX_TIMEOUT_BITS |
                   USB_SIE_STATUS_TRANS_COMPLETE_BITS |
                   USB_SIE_STATUS_ENDPOINT_ERROR_BITS;
    hw_sie_settle();
    TU_LOG(1, "  Data Seq Error: [0] = 0x%04x  [1] = 0x%04x\r\n",
           tu_u32_low16(*hwbuf_ctrl_reg_host(&epx)), tu_u32_high16(*hwbuf_ctrl_reg_host(&epx)));
    epx_hard_reset();
    if (epx.active)
      hw_xfer_complete(&epx, XFER_RESULT_FAILED);
  }

