picocomputer/rp6502/src/tinyusb_rp6502/hcd_rp2040 copy.c
  if ( status & USB_INTS_ERROR_RX_TIMEOUT_BITS )
  {
    handled |= USB_INTS_ERROR_RX_TIMEOUT_BITS;

    // RX_TIMEOUT is an error alternative to BUFF_STATUS/TRANS_COMPLETE.
    // Suppress any coincident completion bits.
    handled |= status & (USB_INTS_BUFF_STATUS_BITS | USB_INTS_TRANS_COMPLETE_BITS);

    if (epx.active)
      hw_xfer_complete(&epx, XFER_RESULT_FAILED);

    epx_hard_reset();
    usb_hw_clear->sie_status = USB_SIE_STATUS_RX_TIMEOUT_BITS |
                               USB_SIE_STATUS_RX_SHORT_PACKET_BITS |
                               USB_SIE_STATUS_TRANS_COMPLETE_BITS |
                               USB_SIE_STATUS_ENDPOINT_ERROR_BITS;
  }

  if ( status & USB_INTS_BUFF_STATUS_BITS )
  {
    handled |= USB_INTS_BUFF_STATUS_BITS;
    handle_hwbuf_status();
  }

  if ( status & USB_INTS_TRANS_COMPLETE_BITS )
  {
    handled |= USB_INTS_TRANS_COMPLETE_BITS;
    usb_hw_clear->sie_status = USB_SIE_STATUS_TRANS_COMPLETE_BITS;
    hw_trans_complete(buf_status_snapshot);
  }

  // Restore interrupt endpoint polling only when the EPX transfer is fully
  // complete (or failed).  Multi-packet double-buffered transfers span several
  // IRQs — intermediate buffer-pair completions leave epx.active==true.
  // Re-enabling polling at that point would let the SIE start an interrupt
  // endpoint poll that clobbers the handshake latches mid-transfer.
  if (_int_ep_suppressed && !epx.active) {
    unsuppress_int_polling();
  }

  if ( status ^ handled )
  {
    panic("Unhandled IRQ 0x%x\n", (uint) (status ^ handled));
  }
}

void __tusb_irq_path_func(hcd_int_handler)(uint8_t rhport, bool in_isr) {
  (void) rhport;
  (void) in_isr;
  hcd_rp2040_irq();
}

int hcd_free_ep_count(void)
{
  int count = 0;
  for (uint i = 1; i < TU_ARRAY_SIZE(ep_pool); i++)
    if (!ep_pool[i].configured) count++;
  return count;
}

static struct hw_endpoint *_next_free_interrupt_ep(void)
{
  for ( uint i = 1; i < TU_ARRAY_SIZE(ep_pool); i++ )
  {
    struct hw_endpoint *ep = &ep_pool[i];
    if ( !ep->configured )
    {
      // Will be configured by hw_endpoint_init / hw_endpoint_allocate
      ep->interrupt_num = (uint8_t) (i - 1);
      return ep;
    }
  }
  return NULL;
}

static hw_endpoint_t *hw_endpoint_allocate(uint8_t transfer_type) {
  hw_endpoint_t *ep = NULL;

  if (transfer_type == TUSB_XFER_CONTROL) {
    ep              = &epx;
    ep->hw_data_buf = &usbh_dpram->epx_data[0];
  } else {
    // Note: even though datasheet name these "Interrupt" endpoints. These are actually
    // "Asynchronous" endpoints and can be used for other type such as: Bulk  (ISO need confirmation)
    ep = _next_free_interrupt_ep();
    TU_VERIFY(ep, NULL);
    pico_info("Allocate %s ep %d\n", tu_edpt_type_str(transfer_type), ep->interrupt_num);
    // 0 for epx (double buffered): TODO increase to 1024 for ISO
    // 2x64 for intep0
    // 3x64 for intep1
    // etc
    // EP data buffers are allocated from the epx_data region (0x180 onwards)
    // We treat epx_data as a flat array and assume 64-byte blocks for interrupts
    ep->hw_data_buf = &usbh_dpram->epx_data[64 * (ep->interrupt_num + 2)];
  }

  return ep;
}

static void hw_endpoint_init(struct hw_endpoint *ep, uint8_t dev_addr, uint8_t ep_addr, uint16_t wMaxPacketSize,
                             uint8_t transfer_type, uint8_t bmInterval) {
  // Already has data buffer, endpoint control, and buffer control allocated at this point
  assert(ep->hw_data_buf);

  uint8_t const num = tu_edpt_number(ep_addr);
  tusb_dir_t const dir = tu_edpt_dir(ep_addr);

  ep->ep_addr = ep_addr;
  ep->dev_addr = dev_addr;

  // Response to a setup packet on EP0 starts with pid of 1
  ep->next_pid = (num == 0 ? 1u : 0u);
  ep->wMaxPacketSize = wMaxPacketSize;

  pico_trace("hw_endpoint_init dev %d ep %02X xfer %d\n", ep->dev_addr, ep->ep_addr, transfer_type);
  pico_trace("dev %d ep %02X setup buffer @ 0x%p\n", ep->dev_addr, ep->ep_addr, ep->hw_data_buf);
  uint dpram_offset = hw_data_offset(ep->hw_data_buf);
  // Bits 0-5 should be 0
  assert(!(dpram_offset & 0b111111));

  // Fill in endpoint control register with buffer offset.
  // Bits [15:6] of the EP_CTRL register hold dpram_offset directly (offset is
  // always 64-byte aligned so bits [5:0] are zero).  EP_CTRL_HOST_INTERRUPT_INTERVAL_LSB
  // is bit 16, which is above the address field — do NOT shift dpram_offset up.
  uint32_t ctrl_value = EP_CTRL_ENABLE_BITS | EP_CTRL_INTERRUPT_PER_BUFFER |
                        ((uint32_t)transfer_type << EP_CTRL_BUFFER_TYPE_LSB) |
                        dpram_offset;
  if (bmInterval) {
    ctrl_value |= (uint32_t)((bmInterval - 1) << EP_CTRL_HOST_INTERRUPT_INTERVAL_LSB);
  }

  io_rw_32 *ctrl_reg = hwep_ctrl_reg_host(ep);
  *ctrl_reg          = ctrl_value;
  pico_trace("endpoint control (0x%p) <- 0x%lx\n", ctrl_reg, ctrl_value);
  ep->configured = true;

  if (ep != &epx) {
    // Endpoint has its own addr_endp and interrupt bits to be setup!
    // This is an interrupt/async endpoint. so need to set up ADDR_ENDP register with:
    // - device address
    // - endpoint number / direction
    // - preamble
    uint32_t reg = (uint32_t)(dev_addr | (num << USB_ADDR_ENDP1_ENDPOINT_LSB));

    if (dir == TUSB_DIR_OUT) {
      reg |= USB_ADDR_ENDP1_INTEP_DIR_BITS;
    }

    if (need_pre(dev_addr)) {
      reg |= USB_ADDR_ENDP1_INTEP_PREAMBLE_BITS;
    }
    usb_hw->int_ep_addr_ctrl[ep->interrupt_num] = reg;

    // Finally, enable interrupt that endpoint
    usb_hw_set->int_ep_ctrl = 1 << (ep->interrupt_num + 1);
  }
}

//--------------------------------------------------------------------+
// HCD API
//--------------------------------------------------------------------+

// Save and disable only USBCTRL_IRQ — finer-grained than save_and_disable_interrupts().
// Use these for internal critical sections; hcd_int_enable/disable is for setup.
TU_ATTR_ALWAYS_INLINE static inline uint32_t usb_irq_save(void) {
  uint32_t prev = irq_is_enabled(USBCTRL_IRQ) ? 1u : 0u;
  irq_set_enabled(USBCTRL_IRQ, false);
  return prev;
}
TU_ATTR_ALWAYS_INLINE static inline void usb_irq_restore(uint32_t prev) {
  if (prev) irq_set_enabled(USBCTRL_IRQ, true);
}

bool hcd_init(uint8_t rhport, const tusb_rhport_init_t* rh_init) {
  (void) rhport;
  (void) rh_init;
  pico_trace("hcd_init %d\n", rhport);
  assert(rhport == 0);

  // Reset any previous state
  rp2usb_init();

  // Force VBUS detect to always present, for now we assume vbus is always provided (without using VBUS En)
  usb_hw->pwr = USB_USB_PWR_VBUS_DETECT_BITS | USB_USB_PWR_VBUS_DETECT_OVERRIDE_EN_BITS;

