picocomputer/rp6502/src/tinyusb_rp6502/hcd_rp2040 copy.c
  // clear epx and interrupt eps
  memset(&ep_pool, 0, sizeof(ep_pool));
  memset(_ep0_mps, 0, sizeof(_ep0_mps));
  _int_ep_suppressed = false;

  // Enable in host mode with SOF / Keep alive on
  usb_hw->main_ctrl = USB_MAIN_CTRL_CONTROLLER_EN_BITS | USB_MAIN_CTRL_HOST_NDEVICE_BITS;
  usb_hw->sie_ctrl = SIE_CTRL_BASE;
  usb_hw->inte = USB_INTE_BUFF_STATUS_BITS      |
                 USB_INTE_HOST_CONN_DIS_BITS    |
                 USB_INTE_HOST_RESUME_BITS      |
                 USB_INTE_STALL_BITS            |
                 USB_INTE_TRANS_COMPLETE_BITS   |
                 USB_INTE_ERROR_RX_TIMEOUT_BITS |
                 USB_INTE_ERROR_DATA_SEQ_BITS   ;

  return true;
}

bool hcd_deinit(uint8_t rhport) {
  (void) rhport;
  reset_block(RESETS_RESET_USBCTRL_BITS);
  unreset_block_wait(RESETS_RESET_USBCTRL_BITS);
  return true;
}

void hcd_port_reset(uint8_t rhport)
{
  (void) rhport;
  pico_trace("hcd_port_reset\n");
  TU_ASSERT(rhport == 0, );
  // TODO: Nothing to do here yet. Perhaps need to reset some state?
}

void hcd_port_reset_end(uint8_t rhport)
{
  (void) rhport;
  TU_ASSERT(rhport == 0, );
  // TODO: Nothing to do here yet. Perhaps need to reset some state?
}

bool hcd_port_connect_status(uint8_t rhport)
{
  (void) rhport;
  pico_trace("hcd_port_connect_status\n");
  TU_ASSERT(rhport == 0);
  return usb_hw->sie_status & USB_SIE_STATUS_SPEED_BITS;
}

tusb_speed_t hcd_port_speed_get(uint8_t rhport)
{
  (void) rhport;
  TU_ASSERT(rhport == 0);

  // TODO: Should enumval this register
  switch ( dev_speed() )
  {
    case 1:
      return TUSB_SPEED_LOW;
    case 2:
      return TUSB_SPEED_FULL;
    default:
      TU_ASSERT(false, TUSB_SPEED_INVALID);
  }
}

// Disable and unconfigure an interrupt endpoint (EP1-15).
static void hw_intep_close(struct hw_endpoint *ep) {
  uint32_t const saved = usb_irq_save();
  usb_hw_clear->int_ep_ctrl = (1u << (ep->interrupt_num + 1));
  usb_hw->int_ep_addr_ctrl[ep->interrupt_num] = 0;
  ep->configured = false;
  *hwep_ctrl_reg_host(ep)  = 0;
  *hwbuf_ctrl_reg_host(ep) = 0;
  hw_endpoint_reset_transfer(ep);
  usb_irq_restore(saved);
}

// Close all opened endpoint belong to this device
void hcd_device_close(uint8_t rhport, uint8_t dev_addr) {
  pico_trace("hcd_device_close %d\n", dev_addr);
  (void) rhport;

  // Clear saved EP0 max packet size
  if (dev_addr < TU_ARRAY_SIZE(_ep0_mps)) {
    _ep0_mps[dev_addr] = 0;
  }

  // reset epx if it belongs to this device (regardless of active state so
  // stale AVAIL/FULL bits in buffer_control are always cleared on close).
  // Critical section: an IRQ between the epx.active check and
  // hw_endpoint_reset_transfer would deliver hcd_event_xfer_complete, letting
  // the class driver re-arm EPX; the close would then zero endpoint_control
  // and buffer_control under the live new transfer.
  if (epx.configured && epx.dev_addr == dev_addr) {
    uint32_t const saved = usb_irq_save();
    if (epx.active) hw_endpoint_reset_transfer(&epx);
    epx.configured = false;
    *hwep_ctrl_reg_host(&epx) = 0;
    *hwbuf_ctrl_reg_host(&epx) = 0;
    usb_irq_restore(saved);
  }

  // dev0 only has ep0
  if (dev_addr != 0) {
    for (size_t i = 1; i < TU_ARRAY_SIZE(ep_pool); i++) {
      hw_endpoint_t *ep = &ep_pool[i];
      if (ep->dev_addr == dev_addr && ep->configured) {
        hw_intep_close(ep);
      }
    }
  }
}

uint32_t hcd_frame_number(uint8_t rhport) {
  (void)rhport;
  return usb_hw->sof_rd;
}

void hcd_int_enable(uint8_t rhport) {
  (void)rhport;
  // Defensive remove before add so re-init never fills up shared IRQ handler slots.
  irq_remove_handler(USBCTRL_IRQ, hcd_rp2040_irq);
  irq_add_shared_handler(USBCTRL_IRQ, hcd_rp2040_irq, PICO_SHARED_IRQ_HANDLER_HIGHEST_ORDER_PRIORITY);
  irq_set_enabled(USBCTRL_IRQ, true);
}

void hcd_int_disable(uint8_t rhport) {
  (void)rhport;
  irq_set_enabled(USBCTRL_IRQ, false);
  irq_remove_handler(USBCTRL_IRQ, hcd_rp2040_irq);
}

//--------------------------------------------------------------------+
// Endpoint API
//--------------------------------------------------------------------+
bool hcd_edpt_open(uint8_t rhport, uint8_t dev_addr, const tusb_desc_endpoint_t *ep_desc) {
  (void)rhport;
  pico_trace("hcd_edpt_open dev_addr %d, ep_addr %d\n", dev_addr, ep_desc->bEndpointAddress);
  hw_endpoint_t *ep = hw_endpoint_allocate(ep_desc->bmAttributes.xfer);
  TU_ASSERT(ep);

  hw_endpoint_init(ep, dev_addr, ep_desc->bEndpointAddress, tu_edpt_packet_size(ep_desc), ep_desc->bmAttributes.xfer,
                   ep_desc->bInterval);

  // Remember EP0 max packet size so hcd_setup_send() can restore it
  if (ep_desc->bEndpointAddress == 0x00 &&
      dev_addr < TU_ARRAY_SIZE(_ep0_mps)) {
    _ep0_mps[dev_addr] = (uint8_t) tu_edpt_packet_size(ep_desc);
  }

  return true;
}

bool hcd_edpt_close(uint8_t rhport, uint8_t daddr, uint8_t ep_addr) {
  (void) rhport;

  struct hw_endpoint *ep = get_dev_ep(daddr, ep_addr);
  if (!ep || !ep->configured || ep == &epx) {
    return true; // EP0 (epx) is shared
  }

  hw_intep_close(ep);
  return true;
}

bool hcd_edpt_xfer(uint8_t rhport, uint8_t dev_addr, uint8_t ep_addr, uint8_t *buffer, uint16_t buflen) {
  (void) rhport;

  pico_trace("hcd_edpt_xfer dev_addr %d, ep_addr 0x%x, len %d\n", dev_addr, ep_addr, buflen);

  const uint8_t    ep_num = tu_edpt_number(ep_addr);
  tusb_dir_t const ep_dir = tu_edpt_dir(ep_addr);

  // Get appropriate ep. Either EPX or interrupt endpoint
  struct hw_endpoint *ep = get_dev_ep(dev_addr, ep_addr);

  TU_ASSERT(ep);

  // EP should be inactive
  TU_ASSERT(!ep->active);

  // For EP0 (shared EPX): always re-init on every phase.
  // EPX is shared across all devices; any intervening hub or other control transfer
  // may have left next_pid in an indeterminate state. hw_endpoint_init() sets
  // next_pid=1 for EP0, which is correct for both DATA and STATUS stages.
  if (ep_num == 0) {
    uint16_t mps = (dev_addr < TU_ARRAY_SIZE(_ep0_mps)) ? _ep0_mps[dev_addr] : 0;
    if (mps == 0) mps = 8;
    hw_endpoint_init(ep, dev_addr, ep_addr, mps, TUSB_XFER_CONTROL, 0);
  }

  // If a normal transfer (non-interrupt) then initiate using
  // sie ctrl registers. Otherwise, interrupt ep registers should
  // already be configured
  if (ep == &epx) {
    // Disable USB IRQ for the window between ep->active=true (set inside
    // hw_endpoint_xfer_start) and the final START_TRANS write.  Without this,
    // a STALL/RX_TIMEOUT/DATA_SEQ IRQ can fire, see ep->active==true, call
    // hw_xfer_complete (clearing active), then we write START_TRANS anyway —
    // hardware starts a real transaction with ep->active==false.
    uint32_t const saved = usb_irq_save();
    epx_prepare_for_start();
    hw_endpoint_xfer_start(ep, buffer, NULL, buflen);

    // That has set up buffer control, endpoint control etc
    // for host we have to initiate the transfer
    usb_hw->dev_addr_ctrl = (uint32_t) (dev_addr | (ep_num << USB_ADDR_ENDP_ENDPOINT_LSB));

