picocomputer/rp6502/src/tinyusb_rp6502/hcd_rp2040 copy.c
    uint32_t flags = USB_SIE_CTRL_START_TRANS_BITS | SIE_CTRL_BASE |
                     (ep_dir ? USB_SIE_CTRL_RECEIVE_DATA_BITS : USB_SIE_CTRL_SEND_DATA_BITS) |
                     (need_pre(dev_addr) ? USB_SIE_CTRL_PREAMBLE_EN_BITS : 0);
    // Suppress interrupt endpoint polling for the duration of this EPX
    // transaction so the SIE cannot overwrite EPX handshake latches.
    suppress_int_polling();
    // START_TRANS bit on SIE_CTRL seems to exhibit the same behavior as the AVAILABLE bit
    // described in RP2040 Datasheet, release 2.1, section "4.1.2.5.1. Concurrent access".
    // We write everything except the START_TRANS bit first, then wait some cycles.
    usb_hw->sie_ctrl = flags & ~USB_SIE_CTRL_START_TRANS_BITS;
    hw_sie_settle();
    usb_hw->sie_ctrl = flags;
    usb_irq_restore(saved);
  } else {
    hw_endpoint_xfer_start(ep, buffer, NULL, buflen);
    // Ensure the async slot is enabled — hcd_edpt_abort_xfer disables it.
    // Skip during EPX suppression: the SIE would poll this endpoint and
    // clobber EPX handshake latches. unsuppress_int_polling() restores all
    // configured bits (including this one) after EPX completes.
    if (!_int_ep_suppressed) {
      usb_hw_set->int_ep_ctrl = (1u << (ep->interrupt_num + 1));
    }
  }
  return true;
}

bool hcd_edpt_abort_xfer(uint8_t rhport, uint8_t dev_addr, uint8_t ep_addr) {
  (void) rhport;
  struct hw_endpoint *ep = get_dev_ep(dev_addr, ep_addr);
  if (!ep) return true;

  uint32_t const saved = usb_irq_save();

  if (ep == &epx) {
    usb_hw->sie_ctrl = SIE_CTRL_BASE;
    hw_sie_settle();
  } else {
    usb_hw_clear->int_ep_ctrl = (1u << (ep->interrupt_num + 1));
  }

  // Reset software endpoint state if it is still marked active.
  if (ep->active) {
    hw_endpoint_reset_transfer(ep);
  }

  // Resetting to DATA0 here pairs with the CLEAR_FEATURE(ENDPOINT_HALT)
  // that callers are expected to send, which resets the device's toggle to DATA0.
  if (ep != &epx) {
    ep->next_pid = 0;
  }

  // Clear hardware buf_ctrl and pending BUFF_STATUS so a stale completion
  // cannot fire after the next transfer is armed on this endpoint.
  *hwbuf_ctrl_reg_host(ep) = 0;
  if (ep == &epx) {
    usb_hw_clear->buf_status = 0x3u;
    // Restore interrupt endpoint polling since this EPX transaction is done.
    unsuppress_int_polling();
  } else {
    usb_hw_clear->buf_status = 0x3u << ((ep->interrupt_num + 1) * 2);
    // Do not re-enable int_ep_ctrl here.  The endpoint has no armed buffer
    // after abort; re-enabling would let the SIE poll the device with no
    // backing buffer.  The next hcd_edpt_xfer() will re-enable it.
  }

  usb_irq_restore(saved);
  return true;
}

bool hcd_setup_send(uint8_t rhport, uint8_t dev_addr, uint8_t const setup_packet[8])
{
  (void) rhport;

  // Copy data into setup packet buffer
  for (uint8_t i = 0; i < 8; i++) {
    usbh_dpram->setup_packet[i] = setup_packet[i];
  }

  // Configure EP0 struct with setup info for the trans complete
  hw_endpoint_t *ep = hw_endpoint_allocate((uint8_t)TUSB_XFER_CONTROL);
  TU_ASSERT(ep);

  // EPX should be inactive
  TU_ASSERT(!ep->active);

  // EP0 out — use the saved MPS for this device, not the (possibly stale) EPX value
  uint16_t mps = (dev_addr < TU_ARRAY_SIZE(_ep0_mps)) ? _ep0_mps[dev_addr] : 0;
  if (mps == 0) {
    if (dev_addr != 0) {
      TU_ASSERT(false);
    }
    // use the USB 2.0 §9.6.1 mandatory minimum of 8.
    mps = 8;
  }
  hw_endpoint_init(ep, dev_addr, 0x00, mps, 0, 0);

  TU_ASSERT(ep->configured);

  // Disable USB IRQ for the window between ep->active=true and the final
  // START_TRANS write.  A STALL/RX_TIMEOUT/DATA_SEQ IRQ fired in this window
  // would see ep->active==true, call hw_xfer_complete (clearing active), then
  // we write START_TRANS — hardware fires a real transaction with ep->active
  // already false; the TRANS_COMPLETE handler silently no-ops.
  uint32_t const saved = usb_irq_save();
  epx_prepare_for_start();
  ep->remaining_len = 8;
  ep->active = true;

  // Set device address
  usb_hw->dev_addr_ctrl = dev_addr;

  // Set pre if we are a low speed device on full speed hub
  uint32_t const flags = SIE_CTRL_BASE | USB_SIE_CTRL_SEND_SETUP_BITS | USB_SIE_CTRL_START_TRANS_BITS |
                         (need_pre(dev_addr) ? USB_SIE_CTRL_PREAMBLE_EN_BITS : 0);

  // Suppress interrupt endpoint polling for the duration of this EPX
  // transaction so the SIE cannot overwrite EPX handshake latches.
  suppress_int_polling();
  // START_TRANS bit on SIE_CTRL seems to exhibit the same behavior as the AVAILABLE bit
  // described in RP2040 Datasheet, release 2.1, section "4.1.2.5.1. Concurrent access".
  // We write everything except the START_TRANS bit first, then wait some cycles.
  usb_hw->sie_ctrl = flags & ~USB_SIE_CTRL_START_TRANS_BITS;
  hw_sie_settle();
  usb_hw->sie_ctrl = flags;
  usb_irq_restore(saved);

  return true;
}

bool hcd_edpt_clear_stall(uint8_t rhport, uint8_t dev_addr, uint8_t ep_addr) {
  (void) rhport;
  struct hw_endpoint *ep = get_dev_ep(dev_addr, ep_addr);
  if (ep) {
    // Critical section: prepare_ep_buffer() (IRQ context) reads ep->next_pid
    // and then does ep->next_pid ^= 1u.  Without protection our zero-write
    // can land between the read and the XOR, losing the reset.
    uint32_t const saved = usb_irq_save();
    ep->next_pid = 0;
    if (ep != &epx) {
      *hwbuf_ctrl_reg_host(ep) = 0;
      usb_hw_clear->buf_status = 0x3u << ((ep->interrupt_num + 1) * 2);
    }
    usb_irq_restore(saved);
  }
  return true;
}

#endif
